# Router 2811
## Setup hostname to route
Router>en
Router#conf t
Router(config)#hostname hq
hq(config-if)#do w

## Configure fastEthernet ip address ' Copper Straight-Through
Router>enable
Router#configure terminal
Router(config)#interface FastEthernet0/0
Router(config-if)#ip address 192.16.3.1 255.255.255.128
Router(config-if)#no shutdown
Router(config-if)#do wr

## Configure serial ip address ' Module WIC-2T :=> Serial DCE
Router>en
Router#conf t
Router(config)#int s0/1/0
Router(config-if)#ip address 10.0.0.1 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#no sh
Router(config-if)#do wr

## Configure DHCP on router
Router>en
Router#conf t
Router(config)#ip dhcp pool LOCAL
Router(dhcp-config)#network 192.168.10.0 255.255.255.0
Router(dhcp-config)#default-router 192.168.10.1
Router(dhcp-config)#dns-server 8.8.8.8
Router(dhcp-config)#exit
Router(config)#ip dhcp excluded-address 192.168.10.1 192.168.10.10
Router(config)#do wr

## Configure protocol rip v2 | Agrega todas las redes adjacentes de router
Router>en
Router#conf t
Router(config)#route rip
Router(config-router)#version 2
Router(config-router)#no auto-summary
Router(config-router)#network 192.168.10.0
Router(config-router)#network 10.0.0.0
Router(config-router)#do wr

## Configure protocol eigrp | Agrega todas las redes adjacentes de router
Router>en
Router#conf t
Router(config)#route eigrp 10
Router(config-router)#no auto-summary
Router(config-router)#network 192.168.10.0
Router(config-router)#network 10.0.0.0
Router(config-router)#do wr

## Configure protocol ospf | Agrega todas las redes adjacentes de router
Router>en
Router#conf t
Router(config)#route ospf 100
Router(config-router)#network 192.168.20.0 0.0.0.255 area 5
Router(config-router)#network 10.0.0.0 0.0.0.3 area 5
Router(config-router)#do wr

## Redistribute rip to eigrp
Router>en
Router#conf t
Router(config)#route rip
Router(config-router)#version 2
Router(config-router)#no auto-summary
Router(config-router)#redistribute eigrp 100 metric 15
Router(config-router)#do w

## Redistribute rip to ospf
Router>en
Router#conf t
Router(config)#route rip
Router(config-router)#no auto-summary
Router(config-router)#redistribute ospf 100 metric 15
Router(config-router)#do w

## Redistribute eigrp to rip
Router>en
Router#conf t
Router(config)#route eigrp 100
Router(config-router)#no auto-summary
Router(config-router)#redistribute rip metric 10000 100 255 255 1500
Router(config-router)#do w

## Redistribute eigrp to ospf
Router>en
Router#conf t
Router(config)#router eigrp 10

## Redistribute ospf to rip
Router>en
Router#conf t
Router(config)#route ospf 100
Router(config-router)#redistribute rip subnets
Router(config-router)#do w

## Redistribute ospf to eigrp
Router>en
Router#conf t
Router(config)#route ospf 100
Router(config-router)#redistribute eigrp 10 subnets
Router(config-router)#do w

## Configure frame-relay static IP addresses on serial
Router>en
Router#conf t
Router(config)#ip route 192.168.30.0 255.255.255.0 10.0.3.1
Router(config)#int s0/3/0
Router(config-if)#encapsulation frame-relay
Router(config-if)#do w

## Configure passwprd
Switch>en
Switch#conf t
Switch(config)#enable password 1234
Switch(config)#do w

## Configure line-console
Switch>en
Switch#conf t
Switch(config)#line console 0
Switch(config-line)#password c0nz0l3
Switch(config-line)#login
Switch(config-line)#do w

## Configure line-vty
Switch>en
Switch#conf t
Switch(config)#line vty 0
Switch(config-line)#password vty0
Switch(config-line)#do w

## Banner message
Switch>en
Switch#conf t
Switch(config)#banner motd $Switch protegido con claves$
Switch(config)#do w

## Enable encryption
Switch>en
Switch#conf t
Switch(config)#service password-encryption
Switch(config)#do w

## Setup username-password
Switch>en
Switch#conf t
Switch(config)#username admin password cisco
Switch(config)#do w

## Configure sub-net on fastEthernet to allow vlan redirection
Router(config)#int f0/0.10
Router(config-subif)#encapsulation dot1Q 10
Router(config-subif)#ip address 192.168.10.1 255.255.255.0

## VTP Server
Switch>en
Switch#conf t
Switch(config)#vtp mode server
Switch(config)#vtp domain LIMON
Switch(config)#vtp password SEGURO
Switch(config)#vtp ver 2

## VTP Client
Switch>en
Switch#conf t
Switch(config)#vtp mode client
Switch(config)#vtp password SEGURO

